iarsystems/ewarm-toshiba-example-projects/TMPM380/TMPM380CMSIS/startup/iar/startup_TMPM380.s
;/**
; ***************************************************************************
; * @file     startup_TMPM380.s
; * @brief    CMSIS Cortex-M3 Core Device Startup File for the
; *           TOSHIBA 'TMPM380' Device Series 
; * @version  V2.2.0
; * @date     2010/07/26
; * 
; * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
; * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
; * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
; * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
; * 
; * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
; * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
; * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
; * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
; * 
; * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
; * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
; * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
; * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
; * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
; * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
; * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
; * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
; * 
; * (C)Copyright TOSHIBA CORPORATION 2010 All rights reserved
; *****************************************************************************
; */
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; Cortex-M version
;

                MODULE  ?cstartup

                ;; Forward declaration of sections.
                SECTION CSTACK:DATA:NOROOT(3)

                SECTION .intvec:CODE:NOROOT(2)

                EXTERN  __iar_program_start
                EXTERN  SystemInit
                PUBLIC  __vector_table

                DATA
__vector_table  DCD     sfe(CSTACK)
                DCD     Reset_Handler

                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     0                         ; Reserved
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; External Interrupts
                DCD     INT0_IRQHandler           ; 0:  Interrupt pin (PH0/AIN0/INT0)
                DCD     INT1_IRQHandler           ; 1:  Interrupt pin (PH1/AIN1/INT1)
                DCD     INT2_IRQHandler           ; 2:  Interrupt pin (PH2/AIN2/INT2)
                DCD     INT3_IRQHandler           ; 3:  Interrupt pin (PA0/TB0IN/INT3)
                DCD     INT4_IRQHandler           ; 4:  Interrupt pin (PA2/TB1IN/INT4)
                DCD     INT5_IRQHandler           ; 5:  Interrupt pin (PE4/TB2IN/INT5)
                DCD     INTRX0_IRQHandler         ; 6:  Serial reception (channel.0)
                DCD     INTTX0_IRQHandler         ; 7:  Serial transmission (channel.0)
                DCD     INTRX1_IRQHandler         ; 8:  Serial reception (channel.1)
                DCD     INTTX1_IRQHandler         ; 9:  Serial transmission (channel.1)
                DCD     INTSSP0_IRQHandler        ; 10: Syncronous Serial Port 0
                DCD     INTSSP1_IRQHandler        ; 11: Syncronous Serial Port 1
                DCD     INTEMG0_IRQHandler        ; 12: PMD0 EMG interrupt (MPT0)
                DCD     INTEMG1_IRQHandler        ; 13: PMD1 EMG interrupt (MPT1)
                DCD     INTSBI0_IRQHandler        ; 14: Serial Bus Interface 0 interrupt
                DCD     INTSBI1_IRQHandler        ; 15: Serial Bus Interface 1 interrupt
                DCD     INTADPD0_IRQHandler       ; 16: ADC conversion triggered by PMD0 is finished
                DCD     INTRTC_IRQHandler         ; 17: Realtime clock interrupt
                DCD     INTADPD1_IRQHandler       ; 18: ADC conversion triggered by PMD1 is finished
                DCD     INTRMCRX_IRQHandler       ; 19: Remote Controller reception interrupt
                DCD     INTTB00_IRQHandler        ; 20: 16bit TMRB0 compare match detection 0/ Over flow
                DCD     INTTB01_IRQHandler        ; 21: 16bit TMRB0 compare match detection 1
                DCD     INTTB10_IRQHandler        ; 22: 16bit TMRB1 compare match detection 0/ Over flow
                DCD     INTTB11_IRQHandler        ; 23: 16bit TMRB1 compare match detection 1
                DCD     INTTB40_IRQHandler        ; 24: 16bit TMRB4 compare match detection 0/ Over flow
                DCD     INTTB41_IRQHandler        ; 25: 16bit TMRB4 compare match detection 1
                DCD     INTTB50_IRQHandler        ; 26: 16bit TMRB5 compare match detection 0/ Over flow
                DCD     INTTB51_IRQHandler        ; 27: 16bit TMRB5 compare match detection 1
                DCD     INTPMD0_IRQHandler        ; 28: PMD0 PWM interrupt (MPT0)
                DCD     INTPMD1_IRQHandler        ; 29: PMD1 PWM interrupt (MPT1)
                DCD     INTCAP00_IRQHandler       ; 30: 16bit TMRB0 input capture 0
                DCD     INTCAP01_IRQHandler       ; 31: 16bit TMRB0 input capture 1
                DCD     INTCAP10_IRQHandler       ; 32: 16bit TMRB1 input capture 0
                DCD     INTCAP11_IRQHandler       ; 33: 16bit TMRB1 input capture 1
                DCD     INTCAP40_IRQHandler       ; 34: 16bit TMRB4 input capture 0
                DCD     INTCAP41_IRQHandler       ; 35: 16bit TMRB4 input capture 1
                DCD     INTCAP50_IRQHandler       ; 36: 16bit TMRB5 input capture 0
                DCD     INTCAP51_IRQHandler       ; 37: 16bit TMRB5 input capture 1
                DCD     INT6_IRQHandler           ; 38: Interrupt Pin (PE6/TB3IN/INT6)
                DCD     INT7_IRQHandler           ; 39: Interrupt Pin (PE7/TB3OUT/INT7)
                DCD     INTRX2_IRQHandler         ; 40: Serial reception (channel.2)
                DCD     INTTX2_IRQHandler         ; 41: Serial transmit (channel.2)
                DCD     INTADCP0_IRQHandler       ; 42: ADC conversion monitoring function interrupt 0
                DCD     INTADCP1_IRQHandler       ; 43: ADC conversion monitoring function interrupt 1
                DCD     INTRX4_IRQHandler         ; 44: Serial reception (channel.4)
                DCD     INTTX4_IRQHandler         ; 45: Serial transmit (channel.4)
                DCD     INTTB20_IRQHandler        ; 46: 16bit TMRB2 compare match detection 0/ Over flow
                DCD     INTTB21_IRQHandler        ; 47: 16bit TMRB2 compare match detection 1
                DCD     INTTB30_IRQHandler        ; 48: 16bit TMRB3 compare match detection 0/ Over flow
                DCD     INTTB31_IRQHandler        ; 49: 16bit TMRB3 compare match detection 1
                DCD     INTCAP20_IRQHandler       ; 50: 16bit TMRB2 input capture 0
                DCD     INTCAP21_IRQHandler       ; 51: 16bit TMRB2 input capture 1
                DCD     INTCAP30_IRQHandler       ; 52: 16bit TMRB3 input capture 0
                DCD     INTCAP31_IRQHandler       ; 53: 16bit TMRB3 input capture 1
                DCD     INTADSFT_IRQHandler       ; 54: ADC conversion started by software is finished
                DCD     0                         ; 55: Reserved
                DCD     INTADTMR_IRQHandler       ; 56: ADC conversion triggered by timer is finished
                DCD     0                         ; 57: Reserved
                DCD     INT8_IRQHandler           ; 58: Interrupt Pin (PA7/TB4IN/INT8)
                DCD     INT9_IRQHandler           ; 59: Interrupt Pin (PD3/INT9)
                DCD     INTA_IRQHandler           ; 60: Interrupt Pin (PJ6/AIN6/INTA)
                DCD     INTB_IRQHandler           ; 61: Interrupt Pin (PJ7/AIN7/INTB)
                DCD     INTENC0_IRQHandler        ; 62: Encoder input0 interrupt
                DCD     INTENC1_IRQHandler        ; 63: Encoder input1 interrupt
                DCD     INTRX3_IRQHandler         ; 64: Serial reception (channel.3)
                DCD     INTTX3_IRQHandler         ; 65: Serial transmit (channel.3)
                DCD     INTTB60_IRQHandler        ; 66: 16bit TMRB6 compare match detection 0 / Over flow
                DCD     INTTB61_IRQHandler        ; 67: 16bit TMRB6 compare match detection 1
                DCD     INTTB70_IRQHandler        ; 68: 16bit TMRB7 compare match detection 0 / Over flow
                DCD     INTTB71_IRQHandler        ; 69: 16bit TMRB7 compare match detection 1
                DCD     INTCAP60_IRQHandler       ; 70: 16bit TMRB6 input capture 0
                DCD     INTCAP61_IRQHandler       ; 71: 16bit TMRB6 input capture 1
                DCD     INTCAP70_IRQHandler       ; 72: 16bit TMRB7 input capture 0
                DCD     INTCAP71_IRQHandler       ; 73: 16bit TMRB7 input capture 1
                DCD     INTC_IRQHandler           ; 74: Interrupt Pin (PD0/ENCA0/TB5IN/INTC)
                DCD     INTD_IRQHandler           ; 75: Interrupt Pin (PD2/ENCZ0/INTD)
                DCD     INTE_IRQHandler           ; 76: Interrupt Pin (PN7/MT2IN/INTE)
                DCD     INTF_IRQHandler           ; 77: Interrupt Pin (PL2/INTF)
                DCD     INTDMACERR_IRQHandler     ; 78: DMA transfer error
                DCD     INTDMACTC_IRQHandler      ; 79: DMA end of transfer
                DCD     INTMTTB00_IRQHandler      ; 80: 16-bit MPT0 IGBT period/ compare match detection 0/Over flow
                DCD     INTMTTB01_IRQHandler      ; 81: 16-bit MPT0 IGBT trigger/ compare match detection 1
                DCD     INTMTTB10_IRQHandler      ; 82: 16-bit MPT1 IGBT period/ compare match detection 0/Over flow
                DCD     INTMTTB11_IRQHandler      ; 83: 16-bit MPT1 IGBT trigger/ compare match detection 1
                DCD     INTMTTB20_IRQHandler      ; 84: 16-bit MPT2 IGBT period/ compare match detection 0/Over flow
                DCD     INTMTTB21_IRQHandler      ; 85: 16-bit MPT2 IGBT trigger/ compare match detection 1
                DCD     INTMTCAP00_IRQHandler     ; 86: 16-bit MPT0 input capture 0
                DCD     INTMTCAP01_IRQHandler     ; 87: 16-bit MPT0 input capture 1
                DCD     INTMTCAP10_IRQHandler     ; 88: 16-bit MPT1 input capture 0
                DCD     INTMTCAP11_IRQHandler     ; 89: 16-bit MPT1 input capture 1
                DCD     INTMTCAP20_IRQHandler     ; 90: 16-bit MPT2 input capture 0
                DCD     INTMTCAP21_IRQHandler     ; 91: 16-bit MPT2 input capture 1
                DCD     INTMTEMG0_IRQHandler      ; 92: 16-bit MPT0 IGBT EMG interrupt
                DCD     INTMTEMG1_IRQHandler      ; 93: 16-bit MPT1 IGBT EMG interrupt
                DCD     INTMTEMG2_IRQHandler      ; 94: 16-bit MPT2 IGBT EMG interrupt

                THUMB
; Dummy Exception Handlers (infinite loops which can be modified)

                PUBWEAK Reset_Handler
                SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__iar_program_start
                BX      R0

                PUBWEAK NMI_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
                B       NMI_Handler

                PUBWEAK HardFault_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
                B       HardFault_Handler

                PUBWEAK MemManage_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
                B       MemManage_Handler

                PUBWEAK BusFault_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
                B       BusFault_Handler

