iarsystems/ewarm-toshiba-example-projects/TMPM380/TMPM380CMSIS/startup/iar/startup_TMPM380.s
                 PUBWEAK INTDMACERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACERR_IRQHandler
                B       INTDMACERR_IRQHandler

                 PUBWEAK INTDMACTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACTC_IRQHandler
                B       INTDMACTC_IRQHandler

                 PUBWEAK INTMTTB00_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTTB00_IRQHandler
                B       INTMTTB00_IRQHandler

                 PUBWEAK INTMTTB01_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTTB01_IRQHandler
                B       INTMTTB01_IRQHandler

                 PUBWEAK INTMTTB10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTTB10_IRQHandler
                B       INTMTTB10_IRQHandler

                 PUBWEAK INTMTTB11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTTB11_IRQHandler
                B       INTMTTB11_IRQHandler

                 PUBWEAK INTMTTB20_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTTB20_IRQHandler
                B       INTMTTB20_IRQHandler

                 PUBWEAK INTMTTB21_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTTB21_IRQHandler
                B       INTMTTB21_IRQHandler

                 PUBWEAK INTMTCAP00_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP00_IRQHandler
                B       INTMTCAP00_IRQHandler

                 PUBWEAK INTMTCAP01_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP01_IRQHandler
                B       INTMTCAP01_IRQHandler

                 PUBWEAK INTMTCAP10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP10_IRQHandler
                B       INTMTCAP10_IRQHandler

                 PUBWEAK INTMTCAP11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP11_IRQHandler
                B       INTMTCAP11_IRQHandler

                 PUBWEAK INTMTCAP20_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP20_IRQHandler
                B       INTMTCAP20_IRQHandler

                 PUBWEAK INTMTCAP21_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP21_IRQHandler
                B       INTMTCAP21_IRQHandler

                 PUBWEAK INTMTEMG0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTEMG0_IRQHandler
                B       INTMTEMG0_IRQHandler

                 PUBWEAK INTMTEMG1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTEMG1_IRQHandler
                B       INTMTEMG1_IRQHandler

                 PUBWEAK INTMTEMG2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTEMG2_IRQHandler
                B       INTMTEMG2_IRQHandler

                END
